Revit 2024 API
NurbsSurfaceData.DegreeU Property
 The degree of the spline in the u-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int DegreeU { get; }
Visual Basic
Public ReadOnly Property DegreeU As Integer
	Get
Visual C++
public:
property int DegreeU {
	int get ();
}
See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace